In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df = pd.read_csv("employees.csv")
df

    First Name  Gender  Salary Bonus % Senior Management                  Team
0      Douglas    Male   97308   6.945              TRUE             Marketing
1       Thomas    Male   61933     NaN              TRUE                   NaN
2        Maria  Female  130590  11.858             FALSE               Finance
3        Jerry    Male     NaN    9.34              TRUE               Finance
4        Larry    Male  101004   1.389              TRUE       Client Services
..         ...     ...     ...     ...               ...                   ...
995      Henry     NaN  132483  16.655             FALSE          Distribution
996    Phillip    Male   42392  19.675             FALSE               Finance
997    Russell    Male   96914   1.421             FALSE               Product
998      Larry    Male   60500  11.985             FALSE  Business Development
999     Albert    Male  129949  10.169              TRUE                 Sales

[1000 rows x 6 columns]

In [3]:
df.head()

  First Name  Gender  Salary Bonus % Senior Management             Team
0    Douglas    Male   97308   6.945              TRUE        Marketing
1     Thomas    Male   61933     NaN              TRUE              NaN
2      Maria  Female  130590  11.858             FALSE          Finance
3      Jerry    Male     NaN    9.34              TRUE          Finance
4      Larry    Male  101004   1.389              TRUE  Client Services

In [4]:
df.shape #check the number of rows and columns of the dataset

(1000, 6)

In [5]:
df.info() #gives a summary of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         931 non-null    object
 1   Gender             852 non-null    object
 2   Salary             998 non-null    object
 3   Bonus %            997 non-null    object
 4   Senior Management  932 non-null    object
 5   Team               957 non-null    object
dtypes: object(6)
memory usage: 47.0+ KB

In [6]:
df["Senior Management"].unique() #returns unique values from the selected column

array(['TRUE', 'FALSE', nan, 'n.a.', '?'], dtype=object)

In [7]:
df["Salary"].unique()

array(['97308', '61933', '130590', nan, '101004', '115163', '65476',
       '45906', '139852', '63241', '102508', '112807', '109831', '41426',
       '59414', '90370', '111737', '132940', '81014', '64714', '100612',
       '90816', '125792', '97950', '37076', '37598', '122367', '124008',
       '79529', '118780', '88657', '122340', '119082', '95734', '85182',
       '142032', '57427', '36844', '122173', '99283', '66582', '121918',
       '73524', '145146', '88010', '114796', '66820', '93581', '113590',
       '94976', '41126', '49339', '40341', '83677', '102488', '130276',
       '64715', '72670', '66851', '48866', '106862', '58112', '35203',
       '77834', '61310', '125250', '51178', '84834', '100863', '84692',
       '118172', '54043', '90582', '62096', '104897', '131604', '107391',
       '114797', '115814', '137126', '47369', '35095', '148115', '83072',
       '100238', '103495', '144887', '64088', '51082', '91719', '128771',
       '119009', '111858', '130620', '43026', '142321', '140371',
       '100705', '77544', '48109', '61602', '103902', '136984', '80740',
       '91712', '42146', '68680', '133980', '37919', '147113', '42153',
       '64363', '114767', '58698', '54585', '76189', '109095', '120204',
       '41054', '84885', '119735', '110169', '73789', '76078', '49368',
       '57325', '66521', '127654', '60866', '41334', '94231', '146670',
       '106317', '109260', '134148', '43542', '95327', '112238', '132373',
       '113850', '110194', '146129', '140013', '122717', '71715', '95322',
       '89227', '124488', '86230', '135490', '121333', '129297', '84546',
       '85730', '104058', '105062', '79536', '114412', '68501', '149563',
       '103386', '89786', '52226', '134645', '59148', '42341', '142178',
       '38989', '53754', '133772', '143499', '97058', '85446', '40297',
       '146651', '124486', '102652', '144474', '68759', '57286', '58129',
       '123940', '98233', '140810', '42090', '149654', '51430', '71749',
       '85700', '57783', '36946', '99326', '109259', '131038', '121068',
       '62719', '69268', '36067', '130581', '89661', '36643', '140558',
       '103521', '55281', '115711', '114079', '57531', '141069', '89434',
       '44639', '110967', '115387', '81673', '109588', '92544', '142373',
       '83341', '98865', '120444', '71945', '109564', '78417', '106947',
       '87298', '64579', '50905', '59728', '51685', '49542', '38375',
       '64084', '147663', '73935', '40837', '94393', '42087', '52080',
       '35061', '64164', '94088', '127813', '38041', '126310', '142561',
       '70817', '59937', '106115', '82782', '104896', '133943', '83658',
       '71896', '113732', '110485', '115118', '48696', '42676', '43586',
       '89258', '90730', '100308', '69134', '58295', '50141', '101941',
       '115145', '40451', '56526', '145316', '103235', '58563', '74129',
       '74669', '97490', '104250', '94345', '82439', '51613', '105946',
       '46080', '134610', '125104', '107281', '141521', '65931', '69989',
       '147183', '66757', '75145', '129460', '132839', '44537', '118733',
       '46905', '79582', '55394', '123811', '137314', '36711', '111786',
       '72257', '71276', '38712', '46930', '125220', '121477', '86386',
       '81308', '84810', '66775', '72145', '121604', '109510', '112117',
       '108127', '123711', '132381', '148225', 'n.a.', '62960', '56926',
       '41428', '115658', '76707', '60388', '45150', '58755', '76076',
       '87760', '135119', '36759', '121723', '110061', '85074', '85799',
       '75150', '91344', '86326', '98753', '113060', '77327', '62666',
       '96633', '58248', '83706', '74086', '95389', '129968', '?',
       '41549', '74287', '69906', '65078', '106406', '115913', '38092',
       '121160', '90429', '64207', '80688', '55044', '72893', '96978',
       '97364', '140885', '58520', '66067', '87721', '144001', '91133',
       '67827', '81839', '81444', '137661', '112548', '111249', '114334',
       '118906', '72979', '64172', '107024', '50167', '106995', '70492',
       '125881', '123294', '131045', '97635', '94493', '140502', '106310',
       '46240', '111163', '93753', '63494', '116693', '85215', '86439',
       '62913', '38872', '124655', '113506', '109980', '91522', '42214',
       '83159', '144082', '47885', '126232', '134598', '66604', '115194',
       '49101', '67811', '111043', '37748', '36403', '140136', '121508',
       '79906', '123144', '46953', '79443', '51395', '134408', '68028',
       '149903', '79123', '104014', '65362', '50701', '144709', '53061',
       '36697', '69244', '101036', '52119', '46666', '73437', '86318',
       '76409', '71642', '67150', '142208', '81183', '107163', '55038',
       '140002', '146812', '40119', '136602', '69579', '101457', '121232',
       '102626', '137171', '88276', '43354', '125556', '59862', '74640',
       '52875', '58789', '122897', '136032', '141958', '139917', '147635',
       '68230', '124365', '104749', '122121', '143541', '137840', '73354',
       '47647', '106249', '93847', '104815', '115436', '50645', '142415',
       '37984', '71751', '135882', '46007', '117055', '58478', '121357',
       '44857', '47322', '81077', '76394', '114356', '41831', '90187',
       '72613', '42748', '37259', '125033', '38275', '71520', '106472',
       '103684', '96111', '90719', '140303', '62161', '78883', '63549',
       '63888', '97370', '66224', '97915', '86883', '37812', '56580',
       '83895', '58047', '124889', '118840', '67780', '144677', '45724',
       '86676', '82401', '35575', '123649', '38078', '52620', '133366',
       '91462', '146589', '51633', '45181', '62454', '84746', '147362',
       '80803', '117293', '105689', '93302', '102555', '51525', '41190',
       '75484', '82726', '122319', '127297', '109290', '99150', '71930',
       '66819', '42424', '51431', '120675', '96610', '71430', '87713',
       '86723', '43414', '87145', '91124', '48141', '90829', '101262',
       '41427', '56993', '114244', '81800', '118736', '66077', '35013',
       '98393', '107111', '65673', '65482', '81919', '59277', '49501',
       '70367', '132156', '56961', '98841', '78226', '116931', '87575',
       '110924', '78351', '125574', '95198', '121006', '95728', '69740',
       '91996', '98385', '90556', '50366', '84232', '100888', '141335',
       '97691', '47266', '139754', '116236', '103405', '41453', '52730',
       '60361', '63103', '65168', '73105', '37916', '45682', '69297',
       '59070', '81215', '128036', '89780', '125018', '133033', '82408',
       '131755', '128305', '147309', '74911', '47079', '82873', '134673',
       '123591', '75598', '89831', '92430', '126956', '112467', '46665',
       '42553', '102081', '135118', '71975', '149908', '45418', '79145',
       '122920', '128031', '59969', '35381', '113129', '141932', '42296',
       '63395', '125382', '113592', '46750', '90285', '53692', '100341',
       '123876', '41643', '113760', '49473', '146141', '79459', '104496',
       '67789', '86564', '135758', '84672', '111580', '50455', '88733',
       '130577', '138925', '62371', '87715', '66029', '86818', '75147',
       '105573', '41230', '117787', '88086', '139959', '93901', '50529',
       '134988', '120941', '118753', '92799', '85718', '109517', '85550',
       '136655', '43312', '102839', '78891', '93201', '84693', '73587',
       '65251', '129148', '128175', '75825', '51821', '60411', '58327',
       '46478', '123963', '79796', '83809', '77933', '51070', '97480',
       '58357', '67165', '145988', '147417', '95003', '144187', '37888',
       '131513', '77287', '46875', '82744', '43252', '66047', '118431',
       '59943', '136681', '138807', '82884', '48668', '122971', '107050',
       '138598', '149456', '128540', '61117', '100949', '46829', '69111',
       '46602', '61181', '94963', '85789', '145274', '102841', '49665',
       '41928', '128042', '86150', '121816', '123409', '98295', '59678',
       '57871', '132084', '35633', '125298', '115582', '148339', '112975',
       '36927', '70248', '141305', '72002', '102577', '113554', '47176',
       '106428', '75181', '79047', '52970', '137979', '114360', '110306',
       '46378', '74104', '132505', '96649', '57811', '111468', '141498',
       '124441', '40121', '129712', '126010', '122762', '149105', '44021',
       '42025', '59970', '145001', '102589', '47529', '148941', '91109',
       '51923', '53954', '39335', '111371', '115057', '145357', '36749',
       '89854', '134048', '141311', '123621', '54941', '106562', '39371',
       '83112', '96941', '47232', '54058', '80399', '118043', '109411',
       '97566', '69267', '87103', '98811', '149684', '71383', '81206',
       '69112', '120672', '96511', '49325', '132175', '118037', '139570',
       '115280', '51065', '103854', '48354', '132327', '106362', '148857',
       '131131', '129663', '41449', '93368', '53335', '148291', '147842',
       '105066', '139284', '63046', '89700', '108946', '98406', '108581',
       '41808', '36837', '140850', '50426', '134120', '57292', '80633',
       '131943', '48046', '97443', '135352', '107816', '96329', '73749',
       '75607', '98858', '76485', '41238', '114896', '125418', '75415',
       '90998', '142868', '135990', '57300', '73706', '85871', '96795',
       '92242', '115149', '126924', '145329', '92587', '60263', '91406',
       '37005', '139791', '45267', '95296', '59680', '144701', '35477',
       '119266', '103877', '47605', '136604', '121250', '35884', '137144',
       '102697', '61999', '45223', '54033', '126120', '99747', '71958',
       '115566', '118369', '51667', '85858', '131423', '49538', '50369',
       '86615', '135369', '60003', '95866', '109324', '103557', '111376',
       '75661', '85213', '140444', '90427', '141439', '43694', '131952',
       '96250', '63126', '44836', '70635', '137386', '104840', '75498',
       '67471', '101914', '93712', '133472', '107351', '142410', '37385',
       '58423', '143638', '113425', '57266', '119667', '127118', '80838',
       '70990', '39833', '45094', '93997', '103050', '121797', '89443',
       '35802', '68164', '93022', '105681', '43050', '44486', '63571',
       '75423', '76381', '137359', '67656', '92436', '137954', '124566',
       '66146', '142935', '46233', '148985', '91411', '146907', '43455',
       '85668', '82871', '136709', '47638', '38344', '100765', '134505',
       '112769', '56450', '98874', '132483', '42392', '96914', '60500',
       '129949'], dtype=object)

In [8]:
df.isnull().sum() #return how many missing values in each column

First Name            69
Gender               148
Salary                 2
Bonus %                3
Senior Management     68
Team                  43
dtype: int64

In [9]:
mvf = ["n.a.", "?", "NA", "n/a", "na", "--"] 
df = pd.read_csv("employees.csv", na_values = mvf) #na_values: parameter that cleans the data atributed to mvf

In [10]:
df["Senior Management"].unique()

array([True, False, nan], dtype=object)

In [11]:
df.isnull().sum()

First Name            70
Gender               149
Salary                 5
Bonus %                4
Senior Management     71
Team                  48
dtype: int64

In [12]:
test_df = df #creates a copy of the dataframe

In [13]:
test_df.isnull().sum()

First Name            70
Gender               149
Salary                 5
Bonus %                4
Senior Management     71
Team                  48
dtype: int64

In [14]:
#test_df.dropna(axis = 0, how = "any", inplace = True)

#dropna() removes all NaN values
#axis = 0, selecting the rows
#how = "any", if any value in a row is a NaN, drop the whole row
#if inplace = True: modifies directly in the test_df

In [15]:
test_df.isnull().sum()

First Name            70
Gender               149
Salary                 5
Bonus %                4
Senior Management     71
Team                  48
dtype: int64

In [16]:
# test_df.dropna(axis = 1, how = "any", inplace = True)

In [17]:
test_df.isnull().sum()

First Name            70
Gender               149
Salary                 5
Bonus %                4
Senior Management     71
Team                  48
dtype: int64

In [18]:
test_df.shape

(1000, 6)

In [58]:
test_df["Salary"].fillna(test_df["Salary"].median())

0       97308.0
1       61933.0
2      130590.0
3       90370.0
4      101004.0
         ...
995    132483.0
996     42392.0
997     96914.0
998     60500.0
999    129949.0
Name: Salary, Length: 1000, dtype: float64

In [62]:
test_df["Salary"].interpolate(method = "linear", direction = "forward")

0       97308.0
1       61933.0
2      130590.0
3      115797.0
4      101004.0
         ...
995    132483.0
996     42392.0
997     96914.0
998     60500.0
999    129949.0
Name: Salary, Length: 1000, dtype: float64